particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
/*
 * Copyright (c) 2018 Particle Industries, Inc.  All rights reserved.
 *
 * This library is free software; you can redistribute it and/or
 * modify it under the terms of the GNU Lesser General Public
 * License as published by the Free Software Foundation, either
 * version 3 of the License, or (at your option) any later version.
 *
 * This library is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * Lesser General Public License for more details.
 *
 * You should have received a copy of the GNU Lesser General Public
 * License along with this library; if not, see <http://www.gnu.org/licenses/>.
 */

#include "logging.h"
LOG_SOURCE_CATEGORY("hal.ble")

#include "ble_hal.h"

#if HAL_PLATFORM_BLE

/* Headers included from nRF5_SDK/components/softdevice/s140/headers */
#include "ble.h"
#include "ble_gap.h"
#include "ble_gatt.h"
#include "ble_gatts.h"
#include "ble_gattc.h"
#include "ble_types.h"
/* Headers included from nRF5_SDK/components/softdevice/common */
#include "nrf_sdh.h"
#include "nrf_sdh_ble.h"
#include "nrf_sdh_soc.h"

#include "app_util.h"

#include "concurrent_hal.h"
#include "static_recursive_mutex.h"
#include <mutex>

#include "gpio_hal.h"
#include "system_error.h"
#include "sdk_config_system.h"

#include <string.h>


#define BLE_CONN_CFG_TAG                            1
#define BLE_OBSERVER_PRIO                           1

#define BLE_ADV_DATA_ADVERTISING                    0
#define BLE_ADV_DATA_SCAN_RESPONSE                  1

#define BLE_DISCOVERY_PROCEDURE_IDLE                0x00
#define BLE_DISCOVERY_PROCEDURE_SERVICES            0x01
#define BLE_DISCOVERY_PROCEDURE_CHARACTERISTICS     0x02
#define BLE_DISCOVERY_PROCEDURE_DESCRIPTORS         0x03

#define BLE_GENERAL_PROCEDURE_TIMEOUT               5000 // In milliseconds
#define BLE_DICOVERY_PROCEDURE_TIMEOUT              15000 // In milliseconds


StaticRecursiveMutex s_bleMutex;

class bleLock {
    static void lock() {
        s_bleMutex.lock();
    }

    static void unlock() {
        s_bleMutex.unlock();
    }
};


typedef void (*evt_handler_t)(void*, void*);

typedef struct {
    evt_handler_t  handler;
    hal_ble_evts_t arg;
    void*          context;
} HalBleEvtMsg_t;

typedef struct {
    uint16_t       discStartHandle;
    uint16_t       discEndHandle;
    hal_ble_svc_t  services[BLE_MAX_SVC_COUNT];
    hal_ble_char_t characteristics[BLE_MAX_CHAR_COUNT];
    hal_ble_desc_t descriptors[BLE_MAX_DESC_COUNT];
    uint8_t        discAll : 1;
    uint8_t        count;
    uint8_t        currIndex;
    uint8_t        currDiscProcedure;
    os_semaphore_t semaphore;
} HalBleDiscovery_t;

// TODO: used when muti-role is implemented
typedef struct {
    uint16_t connHandles[BLE_MAX_LINK_COUNT];
    hal_ble_addr_t peerAddrs[BLE_MAX_LINK_COUNT];
} HalBleConnections_t;

/* BLE Instance */
typedef struct {
    uint8_t  initialized  : 1;
    uint8_t  advertising  : 1;
    uint8_t  scanning     : 1;
    uint8_t  connecting   : 1;
    uint8_t  discovering  : 1;
    uint8_t  connected    : 1;
    int8_t   txPower;
    uint8_t  role;
    uint16_t connHandle;
    uint8_t  advHandle;
    uint8_t  connParamsUpdateAttempts;

    hal_ble_scan_params_t scanParams;
    hal_ble_adv_params_t  advParams;
    hal_ble_conn_params_t ppcp;

    uint8_t  advData[BLE_MAX_ADV_DATA_LEN];
    uint16_t advDataLen;
    uint8_t  scanRespData[BLE_MAX_ADV_DATA_LEN];
    uint16_t scanRespDataLen;

    os_semaphore_t connectSemaphore;
    os_semaphore_t disconnectSemaphore;
    os_semaphore_t connUpdateSemaphore;
    os_semaphore_t discoverySemaphore;
    os_semaphore_t readWriteSemaphore;
    os_queue_t     evtQueue;
    os_thread_t    evtThread;
    os_timer_t     connParamsUpdateTimer;

    on_ble_evt_cb_t onEvtCb;
    void*           context;

    hal_ble_addr_t  peer_addr;
    hal_ble_conn_params_t effectiveConnParams;
    ble_gap_addr_t        whitelist[BLE_MAX_WHITELIST_ADDR_COUNT];
    ble_gap_addr_t const* whitelistPointer[BLE_MAX_WHITELIST_ADDR_COUNT];

    HalBleDiscovery_t     discovery;

    uint16_t readAttrHandle;
    uint8_t  readData[20];
    uint16_t readDataLen;
} HalBleInstance_t;


static HalBleInstance_t s_bleInstance = {
    .initialized  = 0,
    .advertising  = 0,
    .scanning     = 0,
    .connecting   = 0,
    .discovering  = 0,
    .connected    = 0,
    .txPower      = 0,
    .role         = BLE_ROLE_INVALID,
    .connHandle   = BLE_INVALID_CONN_HANDLE,
    .advHandle    = BLE_GAP_ADV_SET_HANDLE_NOT_SET,
    .connParamsUpdateAttempts = 0,

    .scanParams = {
        .version       = 0x01,
        .active        = true,
        .filter_policy = BLE_SCAN_FP_ACCEPT_ALL,
        .interval      = BLE_DEFAULT_SCANNING_INTERVAL,
        .window        = BLE_DEFAULT_SCANNING_WINDOW,
        .timeout       = BLE_DEFAULT_SCANNING_TIMEOUT
    },

    .advParams = {
        .version       = 0x01,
        .type          = BLE_ADV_CONNECTABLE_SCANNABLE_UNDIRECRED_EVT,
        .filter_policy = BLE_ADV_FP_ANY,
        .interval      = BLE_DEFAULT_ADVERTISING_INTERVAL,
        .timeout       = BLE_DEFAULT_ADVERTISING_TIMEOUT,
        .inc_tx_power  = false
    },

    /*
     * For BLE Central, this is the initial connection parameters.
     * For BLE Peripheral, this is the Peripheral Preferred Connection Parameters.
     */
    .ppcp = {
        .version           = 0x01,
        .min_conn_interval = BLE_DEFAULT_MIN_CONN_INTERVAL,
        .max_conn_interval = BLE_DEFAULT_MAX_CONN_INTERVAL,
        .slave_latency     = BLE_DEFAULT_SLAVE_LATENCY,
        .conn_sup_timeout  = BLE_DEFAULT_CONN_SUP_TIMEOUT
    },

    .advData = {
        0x02,
        BLE_SIG_AD_TYPE_FLAGS,
        BLE_SIG_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE
    },
    .advDataLen = 3,

    .scanRespData = { 0 },
    .scanRespDataLen = 0,

    .connectSemaphore = NULL,
    .disconnectSemaphore = NULL,
    .connUpdateSemaphore = NULL,
    .discoverySemaphore = NULL,
    .readWriteSemaphore = NULL,
    .evtQueue  = NULL,
    .evtThread = NULL,
    .connParamsUpdateTimer = NULL,

