particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
    /* Characteristic value attribute metadata */
    memset(&valueAttrMd, 0, sizeof(valueAttrMd));
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&valueAttrMd.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&valueAttrMd.write_perm);
    valueAttrMd.vloc    = BLE_GATTS_VLOC_STACK;
    valueAttrMd.rd_auth = 0;
    valueAttrMd.wr_auth = 0;
    valueAttrMd.vlen    = 1;

    /* Characteristic value attribute */
    memset(&charValueAttr, 0, sizeof(charValueAttr));
    charValueAttr.p_uuid    = uuid;
    charValueAttr.p_attr_md = &valueAttrMd;
    charValueAttr.init_len  = 0;
    charValueAttr.init_offs = 0;
    charValueAttr.max_len   = BLE_MAX_CHAR_VALUE_LEN;
    charValueAttr.p_value   = NULL;

    ret = sd_ble_gatts_characteristic_add(svcHandle, &charMd, &charValueAttr, &charHandles);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gatts_characteristic_add() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    handles->value_handle     = charHandles.value_handle;
    handles->user_desc_handle = charHandles.user_desc_handle;
    handles->cccd_handle      = charHandles.cccd_handle;
    handles->sccd_handle      = charHandles.sccd_handle;

    LOG_DEBUG(TRACE, "Characteristic value handle: %d.", charHandles.value_handle);
    LOG_DEBUG(TRACE, "Characteristic cccd handle: %d.", charHandles.cccd_handle);

    return SYSTEM_ERROR_NONE;
}

static int writeAttribute(uint16_t connHandle, uint16_t attrHandle, const uint8_t* data, uint16_t len, bool response) {
    ble_gattc_write_params_t writeParams;

    if (os_semaphore_create(&s_bleInstance.readWriteSemaphore, 1, 0)) {
        LOG(ERROR, "os_semaphore_create() failed");
        return SYSTEM_ERROR_INTERNAL;
    }

    if (response) {
        writeParams.write_op = BLE_GATT_OP_WRITE_REQ;
    }
    else {
        writeParams.write_op = BLE_GATT_OP_WRITE_CMD;
    }
    writeParams.flags    = BLE_GATT_EXEC_WRITE_FLAG_PREPARED_WRITE;
    writeParams.handle   = attrHandle;
    writeParams.offset   = 0;
    writeParams.len      = len;
    writeParams.p_value  = data;

    ret_code_t ret = sd_ble_gattc_write(connHandle, &writeParams);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gattc_write() failed: %u", (unsigned)ret);
        os_semaphore_destroy(s_bleInstance.readWriteSemaphore);
        return sysError(ret);
    }

    os_semaphore_take(s_bleInstance.readWriteSemaphore, BLE_GENERAL_PROCEDURE_TIMEOUT, false);
    os_semaphore_destroy(s_bleInstance.readWriteSemaphore);

    return SYSTEM_ERROR_NONE;
}

static void isrProcessBleEvent(const ble_evt_t* event, void* context) {
    ret_code_t      ret;
    HalBleEvtMsg_t  msg;
    memset(&msg, 0x00, sizeof(HalBleEvtMsg_t));

    switch (event->header.evt_id) {
        case BLE_GAP_EVT_ADV_SET_TERMINATED: {
            LOG_DEBUG(TRACE, "BLE GAP event: advertising stopped.");
            s_bleInstance.advertising = false;

            if (s_bleInstance.onEvtCb != NULL) {
                msg.handler = (evt_handler_t)s_bleInstance.onEvtCb;
                msg.arg.type = BLE_EVT_ADV_STOPPED;
                msg.arg.params.adv_stopped.version = 0x01;
                msg.arg.params.adv_stopped.reserved = NULL;
                if (os_queue_put(s_bleInstance.evtQueue, &msg, 0, NULL)) {
                    LOG(ERROR, "os_queue_put() failed.");
                }
            }
        } break;

        case BLE_GAP_EVT_ADV_REPORT: {
            LOG_DEBUG(TRACE, "BLE GAP event: advertising report.");

            if (s_bleInstance.onEvtCb != NULL) {
                msg.handler = (evt_handler_t)s_bleInstance.onEvtCb;
                msg.arg.type = BLE_EVT_SCAN_RESULT;
                msg.arg.params.scan_result.version = 0x01;
                msg.arg.params.scan_result.type.connectable = event->evt.gap_evt.params.adv_report.type.connectable;
                msg.arg.params.scan_result.type.scannable = event->evt.gap_evt.params.adv_report.type.scannable;
                msg.arg.params.scan_result.type.directed = event->evt.gap_evt.params.adv_report.type.directed;
                msg.arg.params.scan_result.type.scan_response = event->evt.gap_evt.params.adv_report.type.scan_response;
                msg.arg.params.scan_result.type.extended_pdu = event->evt.gap_evt.params.adv_report.type.extended_pdu;
                msg.arg.params.scan_result.rssi = event->evt.gap_evt.params.adv_report.rssi;
                msg.arg.params.scan_result.data_len = event->evt.gap_evt.params.adv_report.data.len;
                memcpy(msg.arg.params.scan_result.data, event->evt.gap_evt.params.adv_report.data.p_data, msg.arg.params.scan_result.data_len);
                msg.arg.params.scan_result.peer_addr.addr_type = event->evt.gap_evt.params.adv_report.peer_addr.addr_type;
                memcpy(msg.arg.params.scan_result.peer_addr.addr, event->evt.gap_evt.params.adv_report.peer_addr.addr, BLE_SIG_ADDR_LEN);
                if (os_queue_put(s_bleInstance.evtQueue, &msg, 0, NULL)) {
                    LOG(ERROR, "os_queue_put() failed.");
                }
            }

            // Continue scanning, scanning parameters pointer must be set to NULL.
            ret = sd_ble_gap_scan_start(NULL, &s_bleScanData);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gap_scan_start() failed: %u", (unsigned)ret);
            }
        } break;

        case BLE_GAP_EVT_CONNECTED: {
            // FIXME: If multi role is enabled, this flag should not be clear here.
            s_bleInstance.advertising = false;

            LOG_DEBUG(TRACE, "BLE GAP event: connected.");

            if (s_bleInstance.onEvtCb != NULL) {
                msg.handler = (evt_handler_t)s_bleInstance.onEvtCb;
                msg.arg.type = BLE_EVT_CONNECTED;
                msg.arg.params.connected.version = 0x01;
                msg.arg.params.connected.role = event->evt.gap_evt.params.connected.role;
                msg.arg.params.connected.conn_handle = event->evt.gap_evt.conn_handle;
                msg.arg.params.connected.conn_interval = event->evt.gap_evt.params.connected.conn_params.max_conn_interval;
                msg.arg.params.connected.slave_latency = event->evt.gap_evt.params.connected.conn_params.slave_latency;
                msg.arg.params.connected.conn_sup_timeout = event->evt.gap_evt.params.connected.conn_params.conn_sup_timeout;
                msg.arg.params.connected.peer_addr.addr_type = event->evt.gap_evt.params.connected.peer_addr.addr_type;
                memcpy(msg.arg.params.connected.peer_addr.addr, event->evt.gap_evt.params.connected.peer_addr.addr, BLE_SIG_ADDR_LEN);
                if (os_queue_put(s_bleInstance.evtQueue, &msg, 0, NULL)) {
                    LOG(ERROR, "os_queue_put() failed.");
                }
            }

            s_bleInstance.role       = event->evt.gap_evt.params.connected.role;
            s_bleInstance.connHandle = event->evt.gap_evt.conn_handle;
            s_bleInstance.connecting = false;
            s_bleInstance.connected  = true;
            toHalConnParams(&event->evt.gap_evt.params.connected.conn_params, &s_bleInstance.effectiveConnParams);
            s_bleInstance.peer_addr.addr_type = event->evt.gap_evt.params.connected.peer_addr.addr_type;
            memcpy(s_bleInstance.peer_addr.addr, event->evt.gap_evt.params.connected.peer_addr.addr, BLE_SIG_ADDR_LEN);

            LOG_DEBUG(TRACE, "BLE role: %d, connection handle: %d", s_bleInstance.role, s_bleInstance.connHandle);
            LOG_DEBUG(TRACE, "| interval(ms)  latency  timeout(ms) |");
            LOG_DEBUG(TRACE, "  %.2f          %d       %d",
                    s_bleInstance.effectiveConnParams.max_conn_interval*1.25,
                    s_bleInstance.effectiveConnParams.slave_latency,
                    s_bleInstance.effectiveConnParams.conn_sup_timeout*10);

            // Update connection parameters if needed.
            s_bleInstance.connParamsUpdateAttempts = 0;
            updateConnParamsIfNeeded();

            os_semaphore_give(s_bleInstance.connectSemaphore, false);
        } break;

        case BLE_GAP_EVT_DISCONNECTED: {
            LOG_DEBUG(TRACE, "BLE GAP event: disconnected, handle: 0x%04X, reason: %d",
                      event->evt.gap_evt.conn_handle,
                      event->evt.gap_evt.params.disconnected.reason);

            // Stop the connection parameters update timer.
            if (!os_timer_is_active(s_bleInstance.connParamsUpdateTimer, NULL)) {
                os_timer_change(s_bleInstance.connParamsUpdateTimer, OS_TIMER_CHANGE_STOP, true, 0, 0, NULL);
            }

            if (s_bleInstance.onEvtCb != NULL) {
                msg.handler = (evt_handler_t)s_bleInstance.onEvtCb;
                msg.arg.type = BLE_EVT_DISCONNECTED;
                msg.arg.params.disconnected.version = 0x01;
                msg.arg.params.disconnected.reason = event->evt.gap_evt.params.disconnected.reason;
                msg.arg.params.disconnected.conn_handle = event->evt.gap_evt.conn_handle;
                msg.arg.params.disconnected.peer_addr.addr_type = s_bleInstance.peer_addr.addr_type;
                memcpy(msg.arg.params.disconnected.peer_addr.addr, s_bleInstance.peer_addr.addr, BLE_SIG_ADDR_LEN);
                if (os_queue_put(s_bleInstance.evtQueue, &msg, 0, NULL)) {
                    LOG(ERROR, "os_queue_put() failed.");
                }
            }

            // Re-start advertising.
            // FIXME: when multi-role implemented.
            if (s_bleInstance.role == BLE_ROLE_PERIPHERAL) {
                LOG_DEBUG(TRACE, "Restart BLE advertising.");
                ret = sd_ble_gap_adv_start(s_bleInstance.advHandle, BLE_CONN_CFG_TAG);
                if (ret != NRF_SUCCESS) {
                    LOG(ERROR, "sd_ble_gap_adv_start() failed: %u", (unsigned)ret);
                }
                else {
                    s_bleInstance.advertising = true;
                }
            }

            s_bleInstance.connHandle   = BLE_INVALID_CONN_HANDLE;
            s_bleInstance.role         = BLE_ROLE_INVALID;
            s_bleInstance.connected    = false;

            os_semaphore_give(s_bleInstance.disconnectSemaphore, false);
        } break;

        case BLE_GAP_EVT_CONN_PARAM_UPDATE_REQUEST: {
            LOG_DEBUG(TRACE, "BLE GAP event: connection parameter update request.");

            ret = sd_ble_gap_conn_param_update(event->evt.gap_evt.conn_handle,
                    &event->evt.gap_evt.params.conn_param_update_request.conn_params);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gap_conn_param_update() failed: %u", (unsigned)ret);
            }
        } break;

        case BLE_GAP_EVT_CONN_PARAM_UPDATE: {
            LOG_DEBUG(TRACE, "BLE GAP event: connection parameter updated.");

            toHalConnParams(&event->evt.gap_evt.params.conn_param_update.conn_params, &s_bleInstance.effectiveConnParams);

            LOG_DEBUG(TRACE, "| interval(ms)  latency  timeout(ms) |");
            LOG_DEBUG(TRACE, "  %.2f          %d       %d",
                    s_bleInstance.effectiveConnParams.max_conn_interval*1.25,
                    s_bleInstance.effectiveConnParams.slave_latency,
                    s_bleInstance.effectiveConnParams.conn_sup_timeout*10);

            // Update connection parameters if needed.
            updateConnParamsIfNeeded();

            if (s_bleInstance.onEvtCb != NULL) {
                msg.handler = (evt_handler_t)s_bleInstance.onEvtCb;
                msg.arg.type = BLE_EVT_CONN_PARAMS_UPDATED;
                msg.arg.params.conn_params_updated.version = 0x01;
                msg.arg.params.conn_params_updated.conn_handle = event->evt.gap_evt.conn_handle;
                msg.arg.params.conn_params_updated.conn_interval = event->evt.gap_evt.params.conn_param_update.conn_params.max_conn_interval;
                msg.arg.params.conn_params_updated.slave_latency = event->evt.gap_evt.params.conn_param_update.conn_params.slave_latency;
                msg.arg.params.conn_params_updated.conn_sup_timeout = event->evt.gap_evt.params.conn_param_update.conn_params.conn_sup_timeout;
                if (os_queue_put(s_bleInstance.evtQueue, &msg, 0, NULL)) {
                    LOG(ERROR, "os_queue_put() failed.");
                }
            }
            os_semaphore_give(s_bleInstance.connUpdateSemaphore, false);
        } break;

        case BLE_GAP_EVT_PHY_UPDATE_REQUEST: {
            LOG_DEBUG(TRACE, "BLE GAP event: physical update request.");
            ble_gap_phys_t phys = {};
            phys.rx_phys = BLE_GAP_PHY_AUTO;
            phys.tx_phys = BLE_GAP_PHY_AUTO;
            ret = sd_ble_gap_phy_update(event->evt.gap_evt.conn_handle, &phys);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gap_phy_update() failed: %u", (unsigned)ret);
            }
        } break;

        case BLE_GAP_EVT_PHY_UPDATE: {
            LOG_DEBUG(TRACE, "BLE GAP event: physical updated.");
        } break;

        case BLE_GAP_EVT_DATA_LENGTH_UPDATE: {
            LOG_DEBUG(TRACE, "BLE GAP event: gap data length updated.");
            LOG_DEBUG(TRACE, "| txo    rxo     txt(us)     rxt(us) |.");
            LOG_DEBUG(TRACE, "  %d    %d     %d        %d",
                    event->evt.gap_evt.params.data_length_update.effective_params.max_tx_octets,
                    event->evt.gap_evt.params.data_length_update.effective_params.max_rx_octets,
                    event->evt.gap_evt.params.data_length_update.effective_params.max_tx_time_us,
                    event->evt.gap_evt.params.data_length_update.effective_params.max_rx_time_us);
        } break;

        case BLE_GAP_EVT_DATA_LENGTH_UPDATE_REQUEST: {
            LOG_DEBUG(TRACE, "BLE GAP event: gap data length update request.");

            ble_gap_data_length_params_t gapDataLenParams;
            gapDataLenParams.max_tx_octets  = BLE_GAP_DATA_LENGTH_AUTO;
            gapDataLenParams.max_rx_octets  = BLE_GAP_DATA_LENGTH_AUTO;
            gapDataLenParams.max_tx_time_us = BLE_GAP_DATA_LENGTH_AUTO;
            gapDataLenParams.max_rx_time_us = BLE_GAP_DATA_LENGTH_AUTO;
            ret = sd_ble_gap_data_length_update(event->evt.gap_evt.conn_handle, &gapDataLenParams, NULL);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gap_data_length_update() failed: %u", (unsigned)ret);
            }
        } break;

        case BLE_GAP_EVT_SEC_PARAMS_REQUEST: {
            LOG_DEBUG(TRACE, "BLE GAP event: security parameters request.");

            // Pairing is not supported
            ret = sd_ble_gap_sec_params_reply(event->evt.gap_evt.conn_handle, BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP, nullptr, nullptr);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gap_sec_params_reply() failed: %u", (unsigned)ret);
            }
        } break;

        case BLE_GAP_EVT_AUTH_STATUS: {
            LOG_DEBUG(TRACE, "BLE GAP event: authentication status updated.");

            if (event->evt.gap_evt.params.auth_status.auth_status == BLE_GAP_SEC_STATUS_SUCCESS) {
                LOG_DEBUG(TRACE, "Authentication succeeded");
            }
            else {
                LOG_DEBUG(WARN, "Authentication failed, status: %d", (int)event->evt.gap_evt.params.auth_status.auth_status);
            }
        } break;

        case BLE_GAP_EVT_TIMEOUT: {
            if (event->evt.gap_evt.params.timeout.src == BLE_GAP_TIMEOUT_SRC_SCAN) {
                LOG_DEBUG(TRACE, "BLE GAP event: Scanning timeout");
                s_bleInstance.scanning = false;

                if (s_bleInstance.onEvtCb != NULL) {
                    msg.handler = (evt_handler_t)s_bleInstance.onEvtCb;
                    msg.arg.type = BLE_EVT_SCAN_STOPPED;
                    msg.arg.params.scan_stopped.version = 0x01;
                    msg.arg.params.scan_stopped.reserved = NULL;
                    if (os_queue_put(s_bleInstance.evtQueue, &msg, 0, NULL)) {
                        LOG(ERROR, "os_queue_put() failed.");
                    }
                }
            }
            else if (event->evt.gap_evt.params.timeout.src == BLE_GAP_TIMEOUT_SRC_CONN) {
                LOG_DEBUG(ERROR, "BLE GAP event: Connection timeout");
                s_bleInstance.connecting = false;
            }
            else if (event->evt.gap_evt.params.timeout.src == BLE_GAP_TIMEOUT_SRC_AUTH_PAYLOAD) {
                LOG_DEBUG(ERROR, "BLE GAP event: Authenticated payload timeout");
            }
            else {
                LOG_DEBUG(ERROR, "BLE GAP event: Unknown timeout, source: %d", event->evt.gap_evt.params.timeout.src);
            }
        } break;

        case BLE_GATTC_EVT_EXCHANGE_MTU_RSP: {
            LOG_DEBUG(TRACE, "BLE GATT Client event: exchange ATT MTU response.");
            LOG_DEBUG(TRACE, "Effective Server RX MTU: %d.", event->evt.gattc_evt.params.exchange_mtu_rsp.server_rx_mtu);
        } break;

        case BLE_GATTC_EVT_PRIM_SRVC_DISC_RSP: {
            uint8_t svcCount = event->evt.gattc_evt.params.prim_srvc_disc_rsp.count;
            LOG_DEBUG(TRACE, "BLE GATT Client event: %d primary service discovered.", svcCount);

