particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
    if (appearance == NULL) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    ret_code_t ret = sd_ble_gap_appearance_get(appearance);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_appearance_get() failed: %u", (unsigned)ret);
    }

    return sysError(ret);
}

int ble_gap_set_ppcp(const hal_ble_conn_params_t* ppcp, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gap_set_ppcp().");

    if (ppcp == NULL) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    if (    ppcp->min_conn_interval != BLE_SIG_CP_MIN_CONN_INTERVAL_NONE
        && (ppcp->min_conn_interval < BLE_SIG_CP_MIN_CONN_INTERVAL_MIN
        ||  ppcp->min_conn_interval > BLE_SIG_CP_MIN_CONN_INTERVAL_MAX)) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    if (    ppcp->max_conn_interval != BLE_SIG_CP_MAX_CONN_INTERVAL_NONE
        && (ppcp->max_conn_interval < BLE_SIG_CP_MAX_CONN_INTERVAL_MIN
        ||  ppcp->max_conn_interval > BLE_SIG_CP_MAX_CONN_INTERVAL_MAX)) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    if (ppcp->slave_latency > BLE_SIG_CP_SLAVE_LATENCY_MAX) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    if (    ppcp->conn_sup_timeout != BLE_SIG_CP_CONN_SUP_TIMEOUT_NONE
        && (ppcp->conn_sup_timeout < BLE_SIG_CP_CONN_SUP_TIMEOUT_MIN
        ||  ppcp->conn_sup_timeout > BLE_SIG_CP_CONN_SUP_TIMEOUT_MAX)) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    ble_gap_conn_params_t connParams;
    fromHalConnParams(ppcp, &connParams);

    ret_code_t ret = sd_ble_gap_ppcp_set(&connParams);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_ppcp_set() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    memcpy(&s_bleInstance.ppcp, ppcp, sizeof(hal_ble_conn_params_t));

    return SYSTEM_ERROR_NONE;
}

int ble_gap_get_ppcp(hal_ble_conn_params_t* ppcp, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);

    LOG_DEBUG(TRACE, "ble_get_ppcp().");

    if (ppcp == NULL) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    ble_gap_conn_params_t connParams;
    ret_code_t ret = sd_ble_gap_ppcp_get(&connParams);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_ppcp_set() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    return toHalConnParams(&connParams, ppcp);
}

int ble_gap_add_whitelist(const hal_ble_addr_t* addr_list, uint8_t len, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gap_add_whitelist().");

    if (addr_list == NULL || len == 0 || len > BLE_MAX_WHITELIST_ADDR_COUNT) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    for (uint8_t i = 0; i < len; i++) {
        s_bleInstance.whitelist[i].addr_id_peer = true;
        s_bleInstance.whitelist[i].addr_type = addr_list[i].addr_type;
        memcpy(s_bleInstance.whitelist[i].addr, addr_list[i].addr, BLE_SIG_ADDR_LEN);
        s_bleInstance.whitelistPointer[i] = &s_bleInstance.whitelist[i];
    }

    ret_code_t ret = sd_ble_gap_whitelist_set(s_bleInstance.whitelistPointer, len);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_whitelist_set() failed: %u", (unsigned)ret);
    }

    return sysError(ret);
}

int ble_gap_delete_whitelist(void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gap_delete_whitelist().");

    ret_code_t ret = sd_ble_gap_whitelist_set(NULL, 0);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_whitelist_set() failed: %u", (unsigned)ret);
    }

    return sysError(ret);
}

int ble_gap_set_tx_power(int8_t value) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gap_set_tx_power().");

    ret_code_t ret = sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_ADV, s_bleInstance.advHandle, roundTxPower(value));
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_tx_power_set() failed: %u", (unsigned)ret);
    }

    s_bleInstance.txPower = roundTxPower(value);

    return sysError(ret);
}

int ble_gap_get_tx_power(int8_t* value) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gap_get_tx_power().");

    if (value == NULL) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    *value = s_bleInstance.txPower;

    return SYSTEM_ERROR_NONE;
}

int ble_gap_set_advertising_parameters(const hal_ble_adv_params_t* adv_params, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gap_set_advertising_parameters().");

    if (adv_params == NULL) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    ret_code_t ret;
    bool advPending = false;

    // It is invalid to change advertising set parameters while advertising.
    if (s_bleInstance.advertising) {
        int err = ble_gap_stop_advertising();
        if (err != SYSTEM_ERROR_NONE) {
            return err;
        }
        advPending = true;
    }

    ble_gap_adv_params_t bleGapAdvParams;
    memset(&bleGapAdvParams, 0x00, sizeof(ble_gap_adv_params_t));

    bleGapAdvParams.properties.type             = adv_params->type;
    bleGapAdvParams.properties.include_tx_power = false; // FIXME: for extended advertising packet
    bleGapAdvParams.p_peer_addr                 = NULL;
    bleGapAdvParams.interval                    = adv_params->interval;
    bleGapAdvParams.duration                    = adv_params->timeout;
    bleGapAdvParams.filter_policy               = adv_params->filter_policy;
    bleGapAdvParams.primary_phy                 = BLE_GAP_PHY_1MBPS;

    LOG_DEBUG(TRACE, "BLE advertising interval: %.3fms, timeout: %dms.",
            bleGapAdvParams.interval*0.625, bleGapAdvParams.duration*10);

    // Make sure the advertising data and scan response data is consistent.
    ble_gap_adv_data_t bleGapAdvData;
    bleGapAdvData.adv_data.p_data      = s_bleInstance.advData;
    bleGapAdvData.adv_data.len         = s_bleInstance.advDataLen;
    bleGapAdvData.scan_rsp_data.p_data = s_bleInstance.scanRespData;
    bleGapAdvData.scan_rsp_data.len    = s_bleInstance.scanRespDataLen;

    ret = sd_ble_gap_adv_set_configure(&s_bleInstance.advHandle, &bleGapAdvData, &bleGapAdvParams);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_adv_set_configure() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

