particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
    if (advPending) {
        advPending = false;
        return ble_gap_start_advertising(NULL);
    }

    memcpy(&s_bleInstance.advParams, adv_params, sizeof(hal_ble_adv_params_t));

    return sysError(ret);
}

int ble_gap_set_advertising_data(const uint8_t* data, uint16_t len, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gap_set_advertising_data().");

    if ((data == NULL) || (len < 3)) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    return setAdvData(data, len, BLE_ADV_DATA_ADVERTISING);
}

int ble_gap_set_scan_response_data(const uint8_t* data, uint16_t len, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gap_set_scan_response_data().");

    if (data == NULL) {
        len = 0;
    }

    return setAdvData(data, len, BLE_ADV_DATA_SCAN_RESPONSE);
}

int ble_gap_start_advertising(void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gap_start_advertising().");

    if (s_bleInstance.advertising) {
        // Restart advertising
        int error = ble_gap_stop_advertising();
        if (error != SYSTEM_ERROR_NONE) {
            return error;
        }
    }

    ret_code_t ret = sd_ble_gap_adv_start(s_bleInstance.advHandle, BLE_CONN_CFG_TAG);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_adv_start() failed: %u", (unsigned)ret);
        return sysError(ret);
    }
    else {
        s_bleInstance.advertising = true;
        return SYSTEM_ERROR_NONE;
    }
}

int ble_gap_stop_advertising(void) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gap_stop_advertising().");

    if (!s_bleInstance.advertising) {
        return SYSTEM_ERROR_NONE;
    }

    ret_code_t ret = sd_ble_gap_adv_stop(s_bleInstance.advHandle);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_adv_stop() failed: %u", (unsigned)ret);
        return sysError(ret);
    }
    else {
        s_bleInstance.advertising = false;
        return SYSTEM_ERROR_NONE;
    }
}

bool ble_gap_is_advertising(void) {
    return s_bleInstance.advertising;
}

int ble_gap_set_scan_parameters(const hal_ble_scan_params_t* scan_params, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gap_set_scan_parameters().");

    if (scan_params == NULL) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    if (    (scan_params->interval < BLE_GAP_SCAN_INTERVAL_MIN)
         || (scan_params->interval > BLE_GAP_SCAN_INTERVAL_MAX)
         || (scan_params->window < BLE_GAP_SCAN_WINDOW_MIN)
         || (scan_params->window > BLE_GAP_SCAN_WINDOW_MAX)
         || (scan_params->window > scan_params->interval) ) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    memcpy(&s_bleInstance.scanParams, scan_params, sizeof(hal_ble_scan_params_t));

    return SYSTEM_ERROR_NONE;
}

int ble_gap_start_scan(void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gap_start_scan().");

    if (s_bleInstance.scanning) {
        int error = ble_gap_stop_scan();
        if (error != SYSTEM_ERROR_NONE) {
            return error;
        }
    }

    ble_gap_scan_params_t bleGapScanParams;
    fromHalScanParams(&s_bleInstance.scanParams, &bleGapScanParams);

    LOG_DEBUG(TRACE, "| interval(ms)   window(ms)   timeout(ms) |");
    LOG_DEBUG(TRACE, "  %.3f        %.3f      %d",
            bleGapScanParams.interval*0.625,
            bleGapScanParams.window*0.625,
            bleGapScanParams.timeout*10);

    ret_code_t ret = sd_ble_gap_scan_start(&bleGapScanParams, &s_bleScanData);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_scan_start() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    s_bleInstance.scanning = true;

    return SYSTEM_ERROR_NONE;
}

bool ble_gap_is_scanning(void) {
    return s_bleInstance.scanning;
}

int ble_gap_stop_scan(void) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gap_stop_scan().");

    if (!s_bleInstance.scanning) {
        return SYSTEM_ERROR_NONE;
    }

    ret_code_t ret = sd_ble_gap_scan_stop();
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_scan_stop() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    s_bleInstance.scanning = false;
    return SYSTEM_ERROR_NONE;
}

int ble_gap_connect(const hal_ble_addr_t* address, const hal_ble_conn_params_t* params, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gap_connect().");

    int error = ble_gap_stop_scan();
    if (error != SYSTEM_ERROR_NONE) {
        return error;
    }

    if (os_semaphore_create(&s_bleInstance.connectSemaphore, 1, 0)) {
        LOG(ERROR, "os_semaphore_create() failed");
        return SYSTEM_ERROR_INTERNAL;
    }

    ble_gap_addr_t devAddr;
    memset(&devAddr, 0x00, sizeof(ble_gap_addr_t));
    devAddr.addr_type = address->addr_type;
    memcpy(devAddr.addr, address->addr, BLE_SIG_ADDR_LEN);

    ble_gap_scan_params_t bleGapScanParams;
    fromHalScanParams(&s_bleInstance.scanParams, &bleGapScanParams);

    ble_gap_conn_params_t connParams;
    fromHalConnParams(params, &connParams);

    ret_code_t ret = sd_ble_gap_connect(&devAddr, &bleGapScanParams, &connParams, BLE_CONN_CFG_TAG);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_connect() failed: %u", (unsigned)ret);
        os_semaphore_destroy(s_bleInstance.connectSemaphore);
        return sysError(ret);
    }

    s_bleInstance.connecting = true;

    os_semaphore_take(s_bleInstance.connectSemaphore, BLE_GENERAL_PROCEDURE_TIMEOUT, false);
    os_semaphore_destroy(s_bleInstance.connectSemaphore);

