particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
    return 0;
}

bool ble_gap_is_connecting(void) {
    return s_bleInstance.connecting;
}

bool ble_gap_is_connected(void) {
    return s_bleInstance.connected;
}

int ble_gap_connect_cancel(void) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gap_connect_cancel().");

    if (s_bleInstance.connecting) {
        ret_code_t ret = sd_ble_gap_connect_cancel();
        if (ret != NRF_SUCCESS) {
            LOG(ERROR, "sd_ble_gap_connect_cancel() failed: %u", (unsigned)ret);
            return sysError(ret);
        }

        s_bleInstance.connecting = false;
    }

    return 0;
}

int ble_gap_disconnect(uint16_t conn_handle, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gap_disconnect().");

    if (!s_bleInstance.connected) {
        return SYSTEM_ERROR_INVALID_STATE;
    }
    else if (s_bleInstance.role == BLE_ROLE_PERIPHERAL) {
        conn_handle = s_bleInstance.connHandle;
    }
    else if (conn_handle == BLE_INVALID_CONN_HANDLE) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    if (os_semaphore_create(&s_bleInstance.disconnectSemaphore, 1, 0)) {
        LOG(ERROR, "os_semaphore_create() failed");
        return SYSTEM_ERROR_INTERNAL;
    }

    ret_code_t ret = sd_ble_gap_disconnect(conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_disconnect() failed: %u", (unsigned)ret);
        os_semaphore_destroy(s_bleInstance.disconnectSemaphore);
        return sysError(ret);
    }

    os_semaphore_take(s_bleInstance.disconnectSemaphore, BLE_GENERAL_PROCEDURE_TIMEOUT, false);
    os_semaphore_destroy(s_bleInstance.disconnectSemaphore);

    return SYSTEM_ERROR_NONE;
}

int ble_gap_update_connection_params(uint16_t conn_handle, const hal_ble_conn_params_t* conn_params, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gap_update_connection_params().");

    ret_code_t ret;

    if (conn_handle == BLE_INVALID_CONN_HANDLE) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    if (!s_bleInstance.connected) {
        return SYSTEM_ERROR_INVALID_STATE;
    }

    if (os_semaphore_create(&s_bleInstance.connUpdateSemaphore, 1, 0)) {
        LOG(ERROR, "os_semaphore_create() failed");
        return SYSTEM_ERROR_INTERNAL;
    }

    if (conn_params == NULL) {
        // For Central role, this will reject the connection parameter update request.
        // For Peripheral role, this will use the PPCP characteristic value as the connection parameters,
        // and send the request to Central.
        ret = sd_ble_gap_conn_param_update(conn_handle, NULL);
    }
    else {
        // For Central role, this will initiate the connection parameter update procedure.
        // For Peripheral role, this will use the passed in parameters and send the request to central.
        ble_gap_conn_params_t connParams;
        fromHalConnParams(conn_params, &connParams);
        ret = sd_ble_gap_conn_param_update(conn_handle, &connParams);
    }

    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_conn_param_update() failed: %u", (unsigned)ret);
        os_semaphore_destroy(s_bleInstance.connUpdateSemaphore);
        return sysError(ret);
    }

    os_semaphore_take(s_bleInstance.connUpdateSemaphore, BLE_GENERAL_PROCEDURE_TIMEOUT, false);
    os_semaphore_destroy(s_bleInstance.connUpdateSemaphore);

    return SYSTEM_ERROR_NONE;
}

int ble_gap_get_rssi(uint16_t conn_handle, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gap_get_rssi().");

    return 0;
}


/**********************************************
 * BLE GATT Server APIs
 */
int ble_gatt_server_add_service(uint8_t type, const hal_ble_uuid_t* uuid, uint16_t* handle, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gatt_server_add_service_uuid128().");

    ble_uuid_t svcUuid;

    if (uuid == NULL || handle == NULL) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    int ret = fromHalUuid(uuid, &svcUuid);
    if (ret == SYSTEM_ERROR_NONE) {
        ret = addService(type, &svcUuid, handle);
    }

    return ret;
}

int ble_gatt_server_add_characteristic(const hal_ble_char_init_t* char_init, hal_ble_char_handles_t* handles, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gatt_server_add_characteristic_uuid128().");

    ble_uuid_t charUuid;

    if (handles == NULL || char_init == NULL) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    int ret = fromHalUuid(&char_init->uuid, &charUuid);
    if (ret == SYSTEM_ERROR_NONE) {
        ret = addCharacteristic(char_init->service_handle, &charUuid, char_init->properties, char_init->description, handles);
    }

    return ret;
}

int ble_gatt_server_add_descriptor(const hal_ble_desc_init_t* desc_init, uint16_t* handle, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gatt_server_add_characteristic_descriptor().");

    if (desc_init == NULL || handle == NULL) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    ret_code_t ret;
    ble_gatts_attr_t descAttr;
    ble_gatts_attr_md_t descAttrMd;
    ble_uuid_t descUuid;

    fromHalUuid(&desc_init->uuid, &descUuid);

    memset(&descAttrMd, 0, sizeof(descAttrMd));
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&descAttrMd.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&descAttrMd.write_perm);
    descAttrMd.vloc = BLE_GATTS_VLOC_STACK;
    descAttrMd.rd_auth = 0;
    descAttrMd.wr_auth = 0;
    descAttrMd.vlen    = 0;

    memset(&descAttr, 0, sizeof(descAttr));
    descAttr.p_uuid    = &descUuid;
    descAttr.p_attr_md = &descAttrMd;
    descAttr.init_len  = desc_init->len;
    descAttr.init_offs = 0;
    descAttr.max_len   = desc_init->len;
    descAttr.p_value   = desc_init->descriptor;

    // FIXME: check the descriptor to be added
    ret = sd_ble_gatts_descriptor_add(desc_init->char_handle, &descAttr, handle);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gatts_descriptor_add() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    return SYSTEM_ERROR_NONE;
}

