particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
int ble_gatt_server_set_characteristic_value(uint16_t value_handle, const uint8_t* data, uint16_t len, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gatt_server_set_characteristic_value().");

    if (value_handle == BLE_INVALID_ATTR_HANDLE || data == NULL) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    ble_gatts_value_t gattValue;
    gattValue.len     = len;
    gattValue.offset  = 0;
    gattValue.p_value = (uint8_t*)data;

    ret_code_t ret = sd_ble_gatts_value_set(BLE_CONN_HANDLE_INVALID, value_handle, &gattValue);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gatts_value_set() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    return SYSTEM_ERROR_NONE;
}

int ble_gatt_server_get_characteristic_value(uint16_t value_handle, uint8_t* data, uint16_t* len, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gatt_server_get_characteristic_value().");

    if (value_handle == BLE_INVALID_ATTR_HANDLE || data == NULL) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    ble_gatts_value_t gattValue;
    gattValue.len     = *len;
    gattValue.offset  = 0;
    gattValue.p_value = data;

    ret_code_t ret = sd_ble_gatts_value_get(BLE_CONN_HANDLE_INVALID, value_handle, &gattValue);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gatts_value_get() failed: %u", (unsigned)ret);
        *len = 0;
        return sysError(ret);
    }

    *len = gattValue.len;

    return SYSTEM_ERROR_NONE;
}

int ble_gatt_server_notify_characteristic_value(uint16_t value_handle, const uint8_t* data, uint16_t len, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gatt_server_notify_characteristic_value().");

    if (value_handle == BLE_INVALID_ATTR_HANDLE || data == NULL) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    if (s_bleInstance.connHandle == BLE_INVALID_CONN_HANDLE) {
        return SYSTEM_ERROR_INVALID_STATE;
    }

    if (os_semaphore_create(&s_bleInstance.readWriteSemaphore, 1, 0)) {
        LOG(ERROR, "os_semaphore_create() failed");
        return SYSTEM_ERROR_INTERNAL;
    }

    ble_gatts_hvx_params_t hvxParams;

    uint16_t hvxLen = len;
    hvxParams.type   = BLE_GATT_HVX_NOTIFICATION;
    hvxParams.handle = value_handle;
    hvxParams.offset = 0;
    hvxParams.p_data = data;
    hvxParams.p_len  = &hvxLen;

    ret_code_t ret = sd_ble_gatts_hvx(s_bleInstance.connHandle, &hvxParams);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gatts_hvx() failed: %u", (unsigned)ret);
        os_semaphore_destroy(s_bleInstance.readWriteSemaphore);
        return sysError(ret);
    }

    os_semaphore_take(s_bleInstance.readWriteSemaphore, BLE_GENERAL_PROCEDURE_TIMEOUT, false);
    os_semaphore_destroy(s_bleInstance.readWriteSemaphore);

    return ble_gatt_server_set_characteristic_value(value_handle, data, len, NULL);
}

int ble_gatt_server_indicate_characteristic_value(uint16_t value_handle, const uint8_t* data, uint16_t len, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gatt_server_indicate_characteristic_value().");

    if (value_handle == BLE_INVALID_ATTR_HANDLE || data == NULL) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    if (s_bleInstance.connHandle == BLE_INVALID_CONN_HANDLE) {
        return SYSTEM_ERROR_INVALID_STATE;
    }

    if (os_semaphore_create(&s_bleInstance.readWriteSemaphore, 1, 0)) {
        LOG(ERROR, "os_semaphore_create() failed");
        return SYSTEM_ERROR_INTERNAL;
    }

    ble_gatts_hvx_params_t hvxParams;

    uint16_t hvxLen = len;
    hvxParams.type   = BLE_GATT_HVX_INDICATION;
    hvxParams.handle = value_handle;
    hvxParams.offset = 0;
    hvxParams.p_data = data;
    hvxParams.p_len  = &hvxLen;

    ret_code_t ret = sd_ble_gatts_hvx(s_bleInstance.connHandle, &hvxParams);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gatts_hvx() failed: %u", (unsigned)ret);
        os_semaphore_destroy(s_bleInstance.readWriteSemaphore);
        return sysError(ret);
    }

    os_semaphore_take(s_bleInstance.readWriteSemaphore, BLE_GENERAL_PROCEDURE_TIMEOUT, false);
    os_semaphore_destroy(s_bleInstance.readWriteSemaphore);

    return ble_gatt_server_set_characteristic_value(value_handle, data, len, NULL);
}


/**********************************************
 * BLE GATT Client APIs
 */
int ble_gatt_client_discover_all_services(uint16_t conn_handle, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gatt_client_discover_all_services().");

    if (conn_handle == BLE_INVALID_CONN_HANDLE) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    if (s_bleInstance.discovery.currDiscProcedure != BLE_DISCOVERY_PROCEDURE_IDLE) {
        return SYSTEM_ERROR_INVALID_STATE;
    }

    if (os_semaphore_create(&s_bleInstance.discoverySemaphore, 1, 0)) {
        LOG(ERROR, "os_semaphore_create() failed");
        return SYSTEM_ERROR_INTERNAL;
    }

    ret_code_t ret = sd_ble_gattc_primary_services_discover(conn_handle, 0x01, NULL);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gattc_primary_services_discover() failed: %u", (unsigned)ret);
        os_semaphore_destroy(s_bleInstance.discoverySemaphore);
        return sysError(ret);
    }

    memset(&s_bleInstance.discovery, 0x00, sizeof(s_bleInstance.discovery));
    s_bleInstance.discovery.discAll = true;
    s_bleInstance.discovery.currDiscProcedure = BLE_DISCOVERY_PROCEDURE_SERVICES;
    s_bleInstance.discovering = true;

    os_semaphore_take(s_bleInstance.discoverySemaphore, BLE_DICOVERY_PROCEDURE_TIMEOUT, false);
    os_semaphore_destroy(s_bleInstance.discoverySemaphore);

    return SYSTEM_ERROR_NONE;
}

int ble_gatt_client_discover_service_by_uuid(uint16_t conn_handle, const hal_ble_uuid_t* uuid, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);
    LOG_DEBUG(TRACE, "ble_gatt_client_discover_service_by_uuid128().");

    if (conn_handle == BLE_INVALID_CONN_HANDLE || uuid == NULL) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    if (s_bleInstance.discovery.currDiscProcedure != BLE_DISCOVERY_PROCEDURE_IDLE) {
        return SYSTEM_ERROR_INVALID_STATE;
    }

    if (os_semaphore_create(&s_bleInstance.discoverySemaphore, 1, 0)) {
        LOG(ERROR, "os_semaphore_create() failed");
        return SYSTEM_ERROR_INTERNAL;
    }

    ble_uuid_t svcUuid;

    int ret = fromHalUuid(uuid, &svcUuid);
    if (ret == SYSTEM_ERROR_NONE) {
        ret = sd_ble_gattc_primary_services_discover(conn_handle, 0x01, &svcUuid);
        if (ret != NRF_SUCCESS) {
            LOG(ERROR, "sd_ble_gattc_primary_services_discover() failed: %u", (unsigned)ret);
            os_semaphore_destroy(s_bleInstance.discoverySemaphore);
            return sysError(ret);
        }

        memset(&s_bleInstance.discovery, 0x00, sizeof(s_bleInstance.discovery));
        s_bleInstance.discovery.discAll = false;
        s_bleInstance.discovery.currDiscProcedure = BLE_DISCOVERY_PROCEDURE_SERVICES;
        s_bleInstance.discovering = true;

        os_semaphore_take(s_bleInstance.discoverySemaphore, BLE_DICOVERY_PROCEDURE_TIMEOUT, false);
    }

